---
kind: property
id: P:Autodesk.Revit.DB.GraphicsStyle.GraphicsStyleType
source: html/6f969a1c-6691-0d5b-ab9a-c6ab869b7c99.htm
---
# Autodesk.Revit.DB.GraphicsStyle.GraphicsStyleType Property

The graphics style type.

## Syntax (C#)
```csharp
public GraphicsStyleType GraphicsStyleType { get; }
```